app/controllers/attribs_controller.rb

SELECT "attribs".* FROM "attribs"
---
  def index
    @attribs = Attrib.all

INSERT INTO "attribs" ("created_at", "icon", "name", "updated_at", "value") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-11-29 13:49:28.720587"], ["icon", ""], ["name", "velocity"], ["updated_at", "2014-11-29 13:49:28.720587"], ["value", 18]]
---
  def create
    @attrib = Attrib.new(attrib_params)
    @attrib.save

SELECT  "attribs".* FROM "attribs"  WHERE "attribs"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_attrib
      @attrib = Attrib.find(params[:id])