app/controllers/characters_controller.rb

  def index
    @characters = Character.all.page(params[:page]).per(5)
---
SELECT "characters".* FROM "characters"
SELECT COUNT(*) FROM "characters"

  def create
    @character = Character.new(character_params)

    respond_to do |format|
      if @character.save
---
INSERT INTO "characters" ("created_at", "name", "picture", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-11-24 12:56:34.709237"], ["name", ""], ["picture", ""], ["updated_at", "2014-11-24 12:56:34.709237"]]

  def update
    respond_to do |format|
      if @character.update(character_params)
---
UPDATE "characters" SET "name" = ?, "picture" = ?, "updated_at" = ? WHERE "characters"."id" = 1  [["name", "ewrw"], ["picture", "rwer.jpg"], ["updated_at", "2014-11-24 12:56:59.705849"]]

  def destroy
    @character.destroy
---
DELETE FROM "characters" WHERE "characters"."id" = ?  [["id", 2]]